; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	GroundStation11 - direction
	Star12 - direction
	Star0 - direction
	GroundStation8 - direction
	Star10 - direction
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star13 - direction
	Star14 - direction
	GroundStation4 - direction
	Star7 - direction
	Star9 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star14)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star6)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon18)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared2)
	(supports instrument7 image1)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 Star13)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite2 Star15)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 image1)
	(have_image Phenomenon17 infrared2)
	(have_image Phenomenon18 infrared2)
	(have_image Planet19 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation2 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon17 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon17)
   goals met: 0 of 7
5. (take_image satellite2 phenomenon17 instrument5 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon16 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon16)
   goals met: 1 of 7
7. (turn_to satellite1 star10 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 star10)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon16 instrument5 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 7
9. (turn_to satellite2 phenomenon18 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon18)
   goals met: 3 of 7
10. (take_image satellite2 phenomenon18 instrument5 infrared2)
   added: (have_image phenomenon18 infrared2)
   goals met: 4 of 7
11. (turn_to satellite2 planet19 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 planet19)
   goals met: 4 of 7
12. (take_image satellite2 planet19 instrument5 spectrograph0)
   added: (have_image planet19 spectrograph0)
   goals met: 5 of 7
13. (turn_to satellite2 star15 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 star15)
   goals met: 6 of 7
14. (take_image satellite2 star15 instrument5 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 7 of 7
